<template>
  <div class="rate-players">
    <h3 class="rate-players__title title-blue-20">Оценить игроков</h3>
    <div class="rate-players__wrapper">
      <div class="rate-players__header">
        <div class="rate-players__header-content">
          <button class="rate-players__header-btn">
            <svg width="26" height="21" viewBox="0 0 26 21" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                  d="M17.2305 15.1856C17.3017 15.1465 17.36 15.1615 17.4182 15.1615C18.3927 15.1615 19.3703 15.1585 20.3447 15.1646C20.4937 15.1646 20.5293 15.1284 20.5293 14.9899C20.526 10.3256 20.526 5.66127 20.5228 0.99695C20.5228 0.855424 20.5649 0.825312 20.7073 0.828323C21.3289 0.837357 21.9472 0.834346 22.5688 0.828323C22.6918 0.828323 22.7306 0.855424 22.7306 0.975871C22.7274 3.58355 22.7274 6.19124 22.7274 8.80193C22.7274 10.8736 22.7274 12.9453 22.7241 15.017C22.7241 15.1344 22.7533 15.1646 22.8828 15.1646C23.8896 15.1585 24.8996 15.1615 25.9064 15.1615C25.9323 15.1615 25.9582 15.1646 26.0003 15.1676C25.9064 15.3332 25.7672 15.4506 25.6571 15.5861C25.3722 15.9444 25.0744 16.2937 24.7701 16.637C24.1324 17.3597 23.5108 18.0914 22.8828 18.8201C22.4975 19.2688 22.1058 19.7144 21.7271 20.1661C21.6429 20.2685 21.5976 20.2565 21.5199 20.1631C21.18 19.7686 20.8239 19.3862 20.4904 18.9857C19.8818 18.254 19.2635 17.5313 18.6355 16.8117C18.234 16.351 17.8585 15.8722 17.4312 15.4295C17.3664 15.3512 17.3049 15.273 17.2305 15.1856Z"
                  fill="#B9CBE5"/>
              <path
                  d="M0.98 18V7.92H2.688L7.364 15.025V7.92H9.072V18H7.364L2.688 10.895V18H0.98ZM12.621 12.75C12.159 12.75 11.7367 12.638 11.354 12.414C10.9713 12.1853 10.6657 11.882 10.437 11.504C10.213 11.1213 10.101 10.6967 10.101 10.23C10.101 9.77267 10.2177 9.35267 10.451 8.97C10.6843 8.58733 10.9923 8.28167 11.375 8.053C11.7577 7.82433 12.173 7.71 12.621 7.71C13.083 7.71 13.503 7.82433 13.881 8.053C14.2637 8.277 14.5693 8.58033 14.798 8.963C15.0267 9.341 15.141 9.76333 15.141 10.23C15.141 10.6967 15.0267 11.1213 14.798 11.504C14.5693 11.882 14.2637 12.1853 13.881 12.414C13.503 12.638 13.083 12.75 12.621 12.75ZM12.621 11.308C12.817 11.308 12.9967 11.259 13.16 11.161C13.3233 11.063 13.454 10.9323 13.552 10.769C13.65 10.6057 13.699 10.426 13.699 10.23C13.699 10.034 13.65 9.85433 13.552 9.691C13.454 9.52767 13.3233 9.397 13.16 9.299C12.9967 9.201 12.817 9.152 12.621 9.152C12.425 9.152 12.2453 9.201 12.082 9.299C11.9187 9.397 11.788 9.52767 11.69 9.691C11.592 9.85433 11.543 10.034 11.543 10.23C11.543 10.426 11.592 10.6057 11.69 10.769C11.788 10.9323 11.9187 11.063 12.082 11.161C12.2453 11.259 12.425 11.308 12.621 11.308ZM10.521 14.689V13.366H14.721V14.689H10.521Z"
                  fill="#B9CBE5"/>
            </svg>
          </button>
          <button class="rate-players__header-btn" @click="sortAlphabet">
            <svg
                v-if="sortAlphabetCurrent == 0"
                width="20"
                height="20"
                viewBox="0 0 20 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
              <path
                  d="M11.23 14.782c.071-.04.13-.025.188-.025.974 0 1.952-.003 2.927.003.148 0 .184-.037.184-.18L14.523.184c0-.146.042-.177.184-.174.622.01 1.24.006 1.861 0 .123 0 .162.028.162.152-.003 2.683-.003 5.366-.003 8.053 0 2.131 0 4.263-.003 6.395 0 .12.029.151.159.151 1.006-.006 2.016-.003 3.023-.003.026 0 .052.003.094.007-.094.17-.233.29-.343.43-.285.369-.583.728-.887 1.082-.638.743-1.26 1.496-1.887 2.246-.386.462-.777.92-1.156 1.385-.084.105-.13.093-.207-.003-.34-.406-.696-.8-1.03-1.212a123.209 123.209 0 0 0-1.855-2.237c-.401-.474-.777-.966-1.204-1.422-.065-.08-.126-.161-.2-.25ZM5.397 6.711h-3.39l-.392 1.236H0L2.538 0h2.34l2.539 7.947H5.8l-.404-1.236Zm-.45-1.413L3.69 1.413 2.457 5.298h2.49ZM6.656 20H5.089v-2.705H3.23L1.858 20H.081l1.521-2.99a2.44 2.44 0 0 1-.968-.772 2.906 2.906 0 0 1-.404-.721c-.1-.26-.15-.524-.15-.79 0-.289.05-.568.146-.846.098-.276.234-.527.408-.756.169-.22.373-.416.612-.58.24-.164.496-.288.774-.368.275-.081.557-.121.842-.121h3.794V20Zm-1.57-6.535H2.87c-.155 0-.314.04-.479.121-.165.08-.304.183-.42.31-.201.214-.302.49-.302.827 0 .236.084.465.253.685.116.149.262.264.437.353.178.087.346.134.508.134h2.214v-2.43h.004Z"
                  fill="#B9CBE5"
              />
            </svg>
            <svg
                v-if="sortAlphabetCurrent == 1"
                width="20"
                height="20"
                viewBox="0 0 20 20"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
            >
              <path
                  d="M11.23 14.782c.071-.04.13-.025.188-.025.974 0 1.952-.003 2.927.003.148 0 .184-.037.184-.18L14.523.184c0-.146.042-.177.184-.174.622.01 1.24.006 1.861 0 .123 0 .162.028.162.152-.003 2.683-.003 5.366-.003 8.053 0 2.131 0 4.263-.003 6.395 0 .12.029.151.159.151 1.006-.006 2.016-.003 3.023-.003.026 0 .052.003.094.007-.094.17-.233.29-.343.43-.285.369-.583.728-.887 1.082-.638.743-1.26 1.496-1.887 2.246-.386.462-.777.92-1.156 1.385-.084.105-.13.093-.207-.003-.34-.406-.696-.8-1.03-1.212a123.209 123.209 0 0 0-1.855-2.237c-.401-.474-.777-.966-1.204-1.422-.065-.08-.126-.161-.2-.25ZM5.397 18.711h-3.39l-.392 1.236H0L2.538 12h2.34l2.539 7.947H5.8l-.404-1.236Zm-.45-1.413L3.69 13.413l-1.234 3.885h2.49ZM6.656 7.944H5.089V5.24H3.23L1.858 7.944H.081l1.521-2.99a2.44 2.44 0 0 1-.968-.771A2.905 2.905 0 0 1 .23 3.46c-.1-.26-.15-.524-.15-.79 0-.288.05-.567.146-.846.098-.276.234-.527.408-.756.169-.22.373-.415.612-.58.24-.164.496-.288.774-.368C2.295.04 2.577 0 2.862 0h3.794v7.944ZM5.086 1.41H2.87c-.155 0-.314.04-.479.12-.165.081-.304.183-.42.31-.201.214-.302.49-.302.828 0 .235.084.464.253.684.116.15.262.264.437.354.178.086.346.133.508.133h2.214v-2.43h.004Z"
                  fill="#B9CBE5"
              />
            </svg>
          </button>
          <filter-select
              class="rate-players__select group-list__select_white"
              :sortSportsmans="sortSportsmans"
              @selectedSortSportsmas="selectedSortSportsmas = $event"/>
        </div>
        <div class="rate-players__header-content">
          <p class="rate-players__header-col-name">Оценка</p>
          <p class="rate-players__header-col-name">Достижения</p>
        </div>
      </div>
      <div class="rate-players__content">
        <div class="rate-players__players">
          <div
              class="rate-players__player"
              v-for="(player, index) in filter"
              :key="index">
            <div class="rate-players__player-content">
              <div class="rate-players__player-score">{{ player.team_number }}</div>
              <div class="rate-players__player-person">
                <div class="rate-players__player-image">
                  <v-img
                      v-if="player.avatar"
                      :alt="player.full_name"
                      :src="player.avatar"
                      class="rate-players__player-avatar"
                  ></v-img>
                  <v-img
                      v-else
                      :alt="player.full_name"
                      :src="require(`@/assets/images/positionTypes/${player.position_type}.svg`)"
                      class="rate-players__player-avatar rate-players__player-avatar_type"
                      width="56"
                      height="56"
                  ></v-img>
                </div>
                <div class="rate-players__player-info">
                  <div class="rate-players__player-title">{{ player.full_name }}</div>
                  <p class="rate-players__player-subtitle">{{ player.age }} лет, {{ player.position_type }}</p>
                </div>
              </div>
            </div>
            <div class="rate-players__player-progress">
              <custom-progress
                  v-if="player"
                  :progressValue="player.points"
                  v-model="player.points"/>
            </div>
            <div class="rate-players__player-content">
              <div class="rate-players__player-points">
                <div class="rate-players__player-points-wrapper">
                  {{ player.points }} <p>баллов</p>
                </div>
              </div>
              <div class="rate-players__player-achievement">
                <svg width="85" height="60" viewBox="0 0 85 60" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <ellipse cx="42" cy="32.5" rx="27" ry="27.5" fill="#36427D"/>
                  <path
                      d="M17.2244 33.4848C17.103 33.2606 16.8513 33.1557 16.5911 33.0761C15.6424 32.7869 14.6628 32.7527 13.6851 32.7842C12.4861 32.8233 11.2898 32.9319 10.0907 32.9812C8.64434 33.0407 7.44916 32.5051 6.49085 31.3632C7.48552 31.9588 8.54566 31.9734 9.60381 31.8565C10.555 31.7515 11.4955 31.5505 12.4418 31.3988C13.9363 31.1593 15.4327 31.0166 16.9345 31.3477C18.4917 31.691 19.7545 32.5071 20.7355 33.7537C21.6808 34.9553 22.2507 36.3404 22.6517 37.8018C23.0669 39.3157 23.2902 40.8615 23.393 42.4248C23.4162 42.7801 23.3607 43.1405 23.3141 43.4989C23.0671 42.5289 22.726 41.6043 22.2402 40.7366C21.1544 38.7982 19.6041 37.4497 17.3971 36.9437C16.4503 36.7268 15.4923 36.7451 14.5296 36.7939C12.6025 36.8924 10.6751 37.0283 8.74328 36.9183C7.75276 36.8618 6.78643 36.6943 5.89607 36.22C4.2447 35.3394 3.45748 33.8989 3.26716 32.0974C3.14061 30.902 3.40776 29.7589 3.85847 28.6548C3.87915 28.6043 3.90606 28.5562 3.94693 28.5109C3.87141 29.3004 3.87059 30.0824 4.02687 30.8588C4.17558 31.601 4.44721 32.2919 4.94695 32.8673C5.5223 33.5295 6.26968 33.8956 7.12718 34.0537C8.11398 34.2355 9.09065 34.1127 10.0697 33.985C11.7929 33.7602 13.5176 33.5429 15.243 33.333C15.5213 33.2992 15.8077 33.293 16.0868 33.3178C16.4686 33.3513 16.8468 33.4272 17.2244 33.4848Z"
                      fill="#B9CBE5"/>
                  <path
                      d="M67.6171 35.2503C67.7517 35.0191 68.0192 34.9174 68.2948 34.8426C69.2992 34.5705 70.3277 34.5671 71.352 34.6324C72.6082 34.713 73.8592 34.8664 75.1152 34.9577C76.6301 35.0678 77.9012 34.5456 78.944 33.3797C77.8811 33.9714 76.7688 33.9518 75.6629 33.7943C74.6689 33.6528 73.6892 33.4109 72.7018 33.2205C71.1423 32.92 69.5777 32.7208 67.9917 33.0185C66.3472 33.3271 64.9958 34.1414 63.9259 35.4163C62.8948 36.6453 62.2514 38.0791 61.7825 39.5985C61.2971 41.1725 61.0118 42.7862 60.8525 44.4224C60.8163 44.7942 60.8627 45.174 60.8998 45.5514C61.1908 44.5424 61.5791 43.5839 62.1172 42.69C63.32 40.6929 64.9904 39.3299 67.3217 38.8721C68.3218 38.6758 69.3259 38.7267 70.3339 38.8097C72.3517 38.9766 74.3686 39.1828 76.3982 39.1312C77.4389 39.1047 78.4579 38.961 79.4073 38.4929C81.1683 37.6239 82.0415 36.1392 82.3006 34.2562C82.4728 33.0067 82.2303 31.799 81.7941 30.6262C81.7741 30.5726 81.7475 30.5213 81.7061 30.4724C81.7592 31.3028 81.7343 32.123 81.5447 32.9321C81.3642 33.7055 81.0566 34.4211 80.5134 35.0081C79.8882 35.6836 79.0923 36.0429 78.1877 36.1804C77.1468 36.3384 76.1266 36.1774 75.1041 36.0111C73.3042 35.7185 71.5026 35.4336 69.7 35.1565C69.4093 35.1119 69.1091 35.0959 68.8157 35.1126C68.414 35.1352 68.015 35.2023 67.6171 35.2503Z"
                      fill="#B9CBE5"/>
                  <path
                      d="M40.6891 3.50219C41.4412 2.0477 43.5269 2.06389 44.2563 3.52987L51.5713 18.2318C51.8665 18.8252 52.4366 19.2338 53.0935 19.3228L69.7833 21.583C71.4612 21.8102 72.1152 23.8894 70.8696 25.0362L58.8454 36.1072C58.3389 36.5736 58.1079 37.2677 58.2339 37.9446L61.2272 54.0209C61.5305 55.6496 59.8353 56.9197 58.3573 56.1711L43.4037 48.5971C42.8356 48.3094 42.1644 48.3094 41.5963 48.5971L26.5285 56.229C25.0717 56.9669 23.3924 55.7421 23.6498 54.1295L26.2417 37.8939C26.3454 37.2445 26.1232 36.5857 25.6474 36.1317L13.9995 25.0164C12.7882 23.8604 13.4486 21.8167 15.1073 21.5882L31.5551 19.3221C32.1992 19.2333 32.76 18.837 33.0587 18.2594L40.6891 3.50219Z"
                      fill="#2ABAF3"/>
                  <path
                      d="M41.5774 3.96149C41.9534 3.23425 42.9963 3.24234 43.361 3.97533L50.676 18.6772C51.1189 19.5674 51.974 20.1803 52.9593 20.3137L69.6491 22.5739C70.4881 22.6876 70.8151 23.7271 70.1923 24.3006L58.1681 35.3715C57.4083 36.0711 57.0617 37.1123 57.2508 38.1277L60.2441 54.2039C60.3957 55.0183 59.5481 55.6533 58.8091 55.279L43.8555 47.7051C43.0034 47.2734 41.9966 47.2734 41.1445 47.7051L26.0767 55.3369C25.3482 55.7058 24.5086 55.0935 24.6373 54.2872L27.2292 38.0515C27.3847 37.0775 27.0514 36.0892 26.3378 35.4082L14.6899 24.2929L13.9995 25.0164L14.6899 24.2929C14.0842 23.7149 14.4144 22.6931 15.2437 22.5788L31.6916 20.3127C32.6578 20.1796 33.499 19.5851 33.947 18.7187L41.5774 3.96149Z"
                      stroke="white" stroke-opacity="0.5" stroke-width="2"/>
                  <path
                      d="M42.6561 24.1303C42.6397 23.7812 42.6165 23.2851 42.5905 22.7147C42.313 22.6955 42.0478 22.6982 41.7908 22.6556C41.3082 22.5759 40.9842 22.312 41.0129 21.7829C41.0389 21.2937 41.3492 21.0257 41.8168 21.0174C43.1155 20.9968 44.4142 20.9886 45.7129 21.0133C46.205 21.0229 46.5331 21.3143 46.518 21.8448C46.503 22.3643 46.1818 22.6199 45.6814 22.6584C45.4586 22.6762 45.2358 22.6804 44.9678 22.6914C44.9254 23.2383 44.8858 23.7523 44.8448 24.2911C45.4709 24.4725 46.0929 24.6086 46.6807 24.8298C50.1312 26.1286 52.2911 29.5081 52.0724 33.2325C51.8673 36.7329 49.2945 39.8238 45.8291 40.735C42.3513 41.6489 38.6684 40.1234 36.6767 37.06C36.1025 36.1777 35.3356 35.3861 34.5249 34.7099C34.123 34.3746 33.4326 34.3333 32.8599 34.2756C31.7785 34.167 31.3411 33.8262 31.1428 32.7735C30.8079 31.0075 29.9904 30.3546 28.2283 30.444C28.3007 29.5012 29.3944 28.8772 30.4251 29.2483C30.8189 29.3899 31.1592 29.6908 31.5106 29.9368C31.8086 30.1444 32.0793 30.3959 32.3814 30.5965C32.8134 30.8838 33.2331 30.8398 33.6363 30.5003C34.0355 30.1636 34.1339 29.7554 33.9836 29.2675C33.7443 28.4938 32.8448 27.8176 31.9316 27.8121C31.0909 27.8066 30.2474 27.9413 29.4094 27.907C28.6904 27.8767 27.9508 27.7764 27.2686 27.5551C26.7861 27.3985 26.3882 26.9848 26 26.5794C27.1046 27.2129 28.1517 26.9051 29.2344 26.5903C29.6596 26.4667 30.1599 26.6123 30.6261 26.6178C30.8626 26.6206 31.1907 26.6701 31.3083 26.5409C31.4217 26.4172 31.3616 26.0777 31.296 25.8578C31.218 25.5995 31.0608 25.3644 30.9241 25.1267C30.298 24.03 30.7382 23.0872 32.0656 22.8508C31.9945 22.9978 31.9453 23.1009 31.8934 23.2026C31.4723 24.03 31.7252 24.8793 32.6083 25.1528C33.1934 25.3342 33.8769 25.3837 34.4784 25.2765C35.4819 25.0964 36.3691 25.2174 37.2166 25.774C37.8838 26.2124 38.4634 26.189 39.2071 25.7259C40.2515 25.0758 41.4477 24.6732 42.6561 24.1303ZM43.6732 39.6328C47.4709 39.7001 50.6711 36.6051 50.7286 32.8106C50.7873 28.8924 47.7238 25.6998 43.8619 25.6544C40.0888 25.6118 36.8598 28.7068 36.7997 32.4216C36.7368 36.4017 39.7498 39.5641 43.6732 39.6328Z"
                      fill="white"/>
                  <path
                      d="M30.3079 35.5477C30.5636 35.4913 30.8233 35.4501 31.0748 35.3772C32.9586 34.8303 34.4446 35.2027 35.448 37.0677C35.7734 37.6724 36.4077 38.108 36.8903 38.6083C36.2245 39.0783 35.4303 39.0178 34.759 38.3293C34.3954 37.9555 34.1343 37.4594 33.7255 37.1543C33.2375 36.7901 32.6579 36.5276 32.0865 36.3022C31.5 36.0699 30.8766 35.9338 30.2683 35.7566C30.2806 35.6878 30.2943 35.6177 30.3079 35.5477Z"
                      fill="white"/>
                  <path
                      d="M39.8265 30.1484C40.9187 30.7092 42.0288 31.2397 43.0964 31.8444C43.5612 32.1069 43.8415 32.0643 44.2256 31.7069C44.8066 31.1654 45.4628 30.7064 46.2229 30.279C46.1245 30.5319 46.037 30.7875 45.9262 31.0349C45.5257 31.9337 45.1388 32.838 44.7055 33.7203C44.3938 34.3553 43.631 34.5339 43.1634 34.0488C41.9809 32.8188 40.8435 31.5434 39.6884 30.2872C39.7362 30.2405 39.7813 30.1952 39.8265 30.1484Z"
                      fill="white"/>
                </svg>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import FilterSelect from "@/components/library/FilterSelect";
import CustomProgress from "@/components/CustomProgress";

export default {
  components: {
    FilterSelect,
    CustomProgress
  },
  props: {
    items: {
      type: Array,
    }
  },
  data() {
    return {
      sortSportsmans: [
        {
          id: 'all',
          icon: require('@/assets/images/svg/positionTypes/all-select_f.svg'),
          title: 'Все игроки',
        },
        {
          id: 'non-goalies',
          icon: require('@/assets/images/svg/positionTypes/non-goalies-select_f.svg'),
          title: 'Полевые игроки',
        },
        {
          id: 'goalies',
          icon: require('@/assets/images/svg/positionTypes/goalies-select_f.svg'),
          title: 'Вратари',
        },
      ],
      selectedSortSportsmas: 'all',
      sortAlphabetCurrent: 0,
      positionTypes: [
        {slug: 'goalie', title: 'вратарь'},
        {slug: 'defender', title: 'защитник'},
        {slug: 'forward', title: 'нападающий'},
      ],
    }
  },
  computed: {
    filter() {
      if (this.selectedSortSportsmas === 'non-goalies')
        return this.items
            .filter(x => x.position_type === 'forward' || x.position_type === 'defender')
            .concat()
            .sort((a, b) =>
                this.sortAlphabetCurrent == 0
                    ? a.full_name.localeCompare(b.full_name)
                    : b.full_name.localeCompare(a.full_name)
            )
      else if (this.selectedSortSportsmas === 'goalies')
        return this.items
            .filter(x => x.position_type === 'goalie')
            .concat()
            .sort((a, b) =>
                this.sortAlphabetCurrent == 0
                    ? a.full_name.localeCompare(b.full_name)
                    : b.full_name.localeCompare(a.full_name)
            )
      else
        return this.items
            .concat()
            .sort((a, b) =>
                this.sortAlphabetCurrent == 0
                    ? a.full_name.localeCompare(b.full_name)
                    : b.full_name.localeCompare(a.full_name)
            )
    },
  },
  methods: {
    sortAlphabet() {
      this.sortAlphabetCurrent = this.sortAlphabetCurrent === 0 ? 1 : 0
    }
  }
}
</script>

<style scoped lang="scss">
.rate-players {
  &__title {
    margin-left: 30px;
  }

  &__wrapper {
    margin-top: 12px;
    width: 100%;
    border-radius: 28px;
    background-color: $blue01;
    box-shadow: 0px 6px 8px rgba(137, 155, 201, 0.15);
  }

  &__header {
    padding-top: 24px;
    padding-left: 31px;
    padding-right: 62px;
    display: flex;
    justify-content: space-between;
    color: #fff;
  }

  &__header-content {
    display: flex;
    align-items: center;
  }

  &__header-btn {
    &:not(:first-child) {
      margin-left: 27px;
    }
  }

  &__select {
    margin-left: 13px;
    width: 150px;
    background-color: transparent !important;
    color: #fff;

    &::v-deep {

      .group-list__select-title {
        color: #fff;
      }

      .group-list__select-image {
        color: #fff;
      }

      .group-list__menu .v-select-list {

      }
    }
  }

  &__header-col-name {
    &:not(:last-child) {
      margin-right: 63px;
    }
  }

  &__content {
    width: 100%;
    min-height: 70px;
    padding: 30px 62px 20px 33px;
    margin-top: 23px;
    border-radius: 28px;
    background-color: $blue02;
  }

  &__player {
    width: 100%;
    display: flex;
    align-items: center;
    justify-content: space-between;
    color: #fff;

    &:not(:first-child) {
      margin-top: 17px;
    }
  }

  &__player-content {
    display: flex;
    align-items: center;
  }

  &__player-score {
    width: 23.6px;
    height: 18px;
    border-radius: 4px;
    display: flex;
    align-items: center;
    justify-content: center;
    color: #fff;
    font-size: 13px;
    font-weight: 500;
    border: 1px solid #95B0DA;
  }

  &__player-person {
    margin-left: 11.3px;
    display: flex;
    align-items: center;
  }

  &__player-image {
    width: 56px;
    height: 56px;
    border-radius: 50%;
    display: flex;
    align-items: center;
    justify-content: center;
    background-size: cover;
    background-position: center;
    background-repeat: no-repeat;
    border: 2px solid #95B0DA;
    overflow: hidden;

    img {
      width: 21px;
    }
  }

  &__player-avatar {
    width: 56px !important;
    height: 56px !important;

    &::v-deep {

      .v-responsive__content {
        border-radius: 50%;
      }

      .v-image__image--cover {
        width: 56px;
        height: 56px;
        background-size: cover;
        background-position: center;
      }
    }

    &_type {
      &::v-deep {
        .v-responsive__content {
          border-radius: 50%;
        }

        .v-image__image--cover {
          background-size: 22px;
        }
      }
    }
  }

  &__player-info {
    margin-left: 10px;
  }

  &__player-title {
    font-size: 14px;
    font-weight: 600;
    line-height: 1;
  }

  &__player-subtitle {
    margin-top: 4px;
    font-size: 12px;
    font-weight: 400;
  }

  &__player-progress {
    width: 39.6%;
  }

  &__player-points {
    width: 106px;
    height: 43px;
    border-radius: 8px;
    display: flex;
    align-items: center;
    justify-content: center;
    background: linear-gradient(263.56deg, #333876 -4.31%, #464EA3 100%);
    border: 1px solid #333876;
  }

  &__player-points-wrapper {
    display: flex;
    align-items: flex-end;
    font-size: 32px;
    font-weight: 700;
    line-height: 1;

    p {
      margin-left: 4px;
      margin-bottom: 2px;
      font-size: 14px;
      font-weight: 500;
    }
  }

  &__player-achievement {
    width: 83px;
    margin-left: 43px;
    display: flex;
    justify-content: center;
  }
}
</style>
